____________________________________________________________________________________________________
Layer (type)                                 Output Shape                            Param #        
====================================================================================================
conv2d_37 (Conv2D)                           (None, 218, 218, 32)                    4736           
____________________________________________________________________________________________________
batch_normalization_37 (BatchNormalization)  (None, 218, 218, 32)                    128            
____________________________________________________________________________________________________
max_pooling2d_31 (MaxPooling2D)              (None, 109, 109, 32)                    0              
____________________________________________________________________________________________________
conv2d_38 (Conv2D)                           (None, 103, 103, 32)                    50208          
____________________________________________________________________________________________________
batch_normalization_38 (BatchNormalization)  (None, 103, 103, 32)                    128            
____________________________________________________________________________________________________
max_pooling2d_32 (MaxPooling2D)              (None, 51, 51, 32)                      0              
____________________________________________________________________________________________________
dropout_19 (Dropout)                         (None, 51, 51, 32)                      0              
____________________________________________________________________________________________________
conv2d_39 (Conv2D)                           (None, 47, 47, 64)                      51264          
____________________________________________________________________________________________________
batch_normalization_39 (BatchNormalization)  (None, 47, 47, 64)                      256            
____________________________________________________________________________________________________
max_pooling2d_33 (MaxPooling2D)              (None, 23, 23, 64)                      0              
____________________________________________________________________________________________________
conv2d_40 (Conv2D)                           (None, 19, 19, 64)                      102464         
____________________________________________________________________________________________________
batch_normalization_40 (BatchNormalization)  (None, 19, 19, 64)                      256            
____________________________________________________________________________________________________
max_pooling2d_34 (MaxPooling2D)              (None, 9, 9, 64)                        0              
____________________________________________________________________________________________________
dropout_20 (Dropout)                         (None, 9, 9, 64)                        0              
____________________________________________________________________________________________________
conv2d_41 (Conv2D)                           (None, 7, 7, 128)                       73856          
____________________________________________________________________________________________________
batch_normalization_41 (BatchNormalization)  (None, 7, 7, 128)                       512            
____________________________________________________________________________________________________
max_pooling2d_35 (MaxPooling2D)              (None, 3, 3, 128)                       0              
____________________________________________________________________________________________________
conv2d_42 (Conv2D)                           (None, 1, 1, 128)                       147584         
____________________________________________________________________________________________________
batch_normalization_42 (BatchNormalization)  (None, 1, 1, 128)                       512            
____________________________________________________________________________________________________
dropout_21 (Dropout)                         (None, 1, 1, 128)                       0              
____________________________________________________________________________________________________
flatten_7 (Flatten)                          (None, 128)                             0              
____________________________________________________________________________________________________
dense_25 (Dense)                             (None, 1024)                            132096         
____________________________________________________________________________________________________
dense_26 (Dense)                             (None, 512)                             524800         
____________________________________________________________________________________________________
dense_27 (Dense)                             (None, 256)                             131328         
____________________________________________________________________________________________________
dense_28 (Dense)                             (None, 2)                               514            
====================================================================================================
Total params: 1,220,642
Trainable params: 1,219,746
Non-trainable params: 896
____________________________________________________________________________________________________
